-- 创建 month_issue_record 表
CREATE TABLE month_issue_record (
    id INT AUTO_INCREMENT PRIMARY KEY,
    periods VARCHAR(25) COMMENT '月报对应LTN序号组',
    time_diff_desc TEXT COMMENT '时长差异存在原因',
    front_month_desc TEXT COMMENT '前端月度总结',
    other_month_desc TEXT COMMENT '其他月度总结'
);

-- 不小心删除了 week_issue_record 表，重新添加数据
INSERT INTO week_issue_record
VALUES (3,
13,
'概况:炸裂，这个周期拖得特别长，因为LTN总共花了25h40m，今天早上才做完->得优化',
'这个长周期里面，前端完成了很多学习内容
1、LTN 32错题 + ①③共计 76题:108题+月报+季报>复盘还是能够发现很多问题的，尤其怎么调整学习方法来提高效率!
2、投递 35份简历 +产出一份英文简历 ->开始投递后，发现的确没啥回复，还是坚持、持续投递	
3、模拟面试题组1组+redux 学习+MySQL+Daily日报存储到数据库+Nextjs官网指引文档+postman ->我爱Coding!做自己的项目!',
'1、月光变奏曲原著-通宵->小说可以慢悠悠看，还是得好好睡觉，睡不好第二天好难受，起床也难受，头也痛，不舒服
2、上头禹宙中欣星光大赏->检索式学习和一些视频可以共存的~不用强迫自己非要停下来~	',
'有3天2点之后睡，一次是跨年12.31，一次是星光大赏，一次是月光原著->其实偶尔熬一次还好，能够隔天就恢复过来~不错子~这就是韧性~',
'练1休2-练2休2-练5休2-练1休1-练2:	练11休7	新年新气象~休的一半是熬夜或者练累了~发现散发跳操很快乐~喜欢上了~',
'12.30《小小的我》1.14《雄狮少年2》	> 喜欢~有俯视社会的，也有热血爆燃的~喜欢~甚至回家看到了风在跳舞~	',
'听5休2听12	>强!几乎没停!虽然种草的TED不多，但是多了解一些东西也不错~就当做看知识新闻了	',
'《有效学习》阅4休6阅2休7> 被磕 CP 重创，哈哈，挤占了所有学习时间，静不下心来看->下周期边晒太阳边看好了~	',
'1、LTN 计划再度优化-做题5分钟，纠正20分钟，LTN包含了比较多、多样化的知识，尽可能在一个周期里面，一半复习、一半学习-
周期不能太长，很难把控，19天有点久，10天差不多->之前做题预估4天，现在预估应该要到6-7天，所以尽可能周期的每天都在做1-2h LTN
2、前端学习时长超过1h +早上2h对我非常有用!继续坚持
3、因为时间太长了，反而没什么感受，也有点不知道怎么复盘',
'1、和小珍聚了一次:1.4拍毕业照+带汤圆玩	和蕾姐、馨尹、大大聚]	一次烧烤	给康康送了一次信	-> 真好，和朋友们保持联系~	
2、炸裂，我又磕rps了，但是这对真的产出的都是快乐~那就开心磕~两个人都是好人~我和Re共存~
3、积极运动~习惯后不作为需要意志力的事情;熬夜后也可以快速恢复~超级棒',
'下周主要学习的内容（9天 1.17 - 1.25）：
- 每天 LTN 题目 1-2h [缩短周期]
- 模拟题10题9组（进LTN1盒子）+ hooks 官网5题
- 每天 手撕题[数据结构算法题 网站 + 40题博客做过的题]
- 1.19 上次 LTN 测验错题 28 题
- 每天 18:00 投递 1-2 家
- LTN 工具[做题时间记录]
运动【约尔太太COS】+睡眠：
- 3-4次/7天
- 9点前醒，1点以前睡觉时间
TED+阅读+播客：
- TED ：主要听+英文字幕，记录思维的闪光弧 - 补充弹药 + 你最喜欢哪一句话呀？
- 阅读：《有效阅读》+ 晒太阳，隔天记得写收获哦 + 你最喜欢哪一句话呀？
- 播客：多看看世界~看看多样性吧~', null, null)